In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.rand(4,3)
df = pd.DataFrame(data, columns=['X', 'Y', 'Z'])
df

          X         Y         Z
0  0.866507  0.193290  0.104090
1  0.174854  0.914310  0.559245
2  0.778269  0.157471  0.267795
3  0.843680  0.624179  0.716237

In [4]:
data = {'X': [3, 1, 4, 1], 'Y': [2, 3, 1, 4]}
df = pd.DataFrame(data)
df['Rank'] = df['X'].rank()
df

   X  Y  Rank
0  3  2   3.0
1  1  3   1.5
2  4  1   4.0
3  1  4   1.5

In [5]:
data = {'X': ['1', '2', '3']}
df = pd.DataFrame(data)
df['X'] = df['X'].astype(int)
print(df)

   X
0  1
1  2
2  3

In [6]:
df['X'].dtype

dtype('int32')

In [7]:
data = {'X': ['foo', 'bar', 'baz', 'qux']}
df = pd.DataFrame(data)
filtered_df = df[df['X'].str.contains('ba')]
filtered_df

     X
1  bar
2  baz

In [8]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2', 'col3'])
print(df)

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [9]:
data = {'X': [1, 2, 3], 'Y': [4, 5, 6]}
df = pd.DataFrame(data)
transposed_df = df.T
transposed_df

   0  1  2
X  1  2  3
Y  4  5  6

In [10]:
df

   X  Y
0  1  4
1  2  5
2  3  6

In [11]:
df.set_index('X', inplace=True)
df

   Y
X
1  4
2  5
3  6

In [12]:
df.reset_index(inplace=True)
df

   X  Y
0  1  4
1  2  5
2  3  6

In [13]:
df = df.add_prefix('col_')
df

   col_X  col_Y
0      1      4
1      2      5
2      3      6

In [14]:
date_range = pd.date_range(start='1/1/2024', periods=5, freq='D')
data = {'X': [1, 2, 3, 4, 5]}
df = pd.DataFrame(data, index=date_range)
filtered_df = df['2024-01-02':'2024-01-05']
filtered_df

            X
2024-01-02  2
2024-01-03  3
2024-01-04  4
2024-01-05  5